---
kind: property
id: P:Autodesk.Revit.DB.Family.StructuralSectionShape
zh: 族
source: html/dd92fb5d-7aca-13c1-7402-2f67efba64ec.htm
---
# Autodesk.Revit.DB.Family.StructuralSectionShape Property

**中文**: 族

The family's structural section shape.

## Syntax (C#)
```csharp
public StructuralSectionShape StructuralSectionShape { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: This Family cannot have a structural section.